ValerianGregoire/esp32-WROOM-32UE-full-driver/bin/gpio_matrix_registers.h
#define GPIO_FUNC0_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44530))
#define GPIO_FUNC1_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44534))
#define GPIO_FUNC2_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44538))
#define GPIO_FUNC3_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4453C))
#define GPIO_FUNC4_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44540))
#define GPIO_FUNC5_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44544))
#define GPIO_FUNC6_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44548))
#define GPIO_FUNC7_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4454C))
#define GPIO_FUNC8_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44550))
#define GPIO_FUNC9_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44554))
#define GPIO_FUNC10_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44558))
#define GPIO_FUNC11_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4455C))
#define GPIO_FUNC12_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44560))
#define GPIO_FUNC13_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44564))
#define GPIO_FUNC14_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44568))
#define GPIO_FUNC15_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4456C))
#define GPIO_FUNC16_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44570))
#define GPIO_FUNC17_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44574))
#define GPIO_FUNC18_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44578))
#define GPIO_FUNC19_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4457C))
#define GPIO_FUNC20_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44580))
#define GPIO_FUNC21_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44584))
#define GPIO_FUNC22_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44588))
#define GPIO_FUNC23_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4458C))
#define GPIO_FUNC24_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44590))
#define GPIO_FUNC25_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44594))
#define GPIO_FUNC26_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44598))
#define GPIO_FUNC27_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4459C))
#define GPIO_FUNC28_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445A0))
#define GPIO_FUNC29_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445A4))
#define GPIO_FUNC30_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445A8))
#define GPIO_FUNC31_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445AC))
#define GPIO_FUNC32_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445B0))
#define GPIO_FUNC33_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445B4))
#define GPIO_FUNC34_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445B8))
#define GPIO_FUNC35_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445BC))
#define GPIO_FUNC36_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445C0))
#define GPIO_FUNC37_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445C4))
#define GPIO_FUNC38_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445C8))
#define GPIO_FUNC39_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445CC))
#define GPIO_FUNC40_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445D0))
#define GPIO_FUNC41_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445D4))
#define GPIO_FUNC42_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445D8))
#define GPIO_FUNC43_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445DC))
#define GPIO_FUNC44_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445E0))
#define GPIO_FUNC45_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445E4))
#define GPIO_FUNC46_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445E8))
#define GPIO_FUNC47_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445EC))
#define GPIO_FUNC48_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445F0))
#define GPIO_FUNC49_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445F4))
#define GPIO_FUNC50_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445F8))
#define GPIO_FUNC51_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF445FC))
#define GPIO_FUNC52_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44600))
#define GPIO_FUNC53_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44604))
#define GPIO_FUNC54_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44608))
#define GPIO_FUNC55_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4460C))
#define GPIO_FUNC56_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44610))
#define GPIO_FUNC57_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44614))
#define GPIO_FUNC58_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44618))
#define GPIO_FUNC59_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4461C))
#define GPIO_FUNC60_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44620))
#define GPIO_FUNC61_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44624))
#define GPIO_FUNC62_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44628))
#define GPIO_FUNC63_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4462C))
#define GPIO_FUNC64_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44630))
#define GPIO_FUNC65_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44634))
#define GPIO_FUNC66_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44638))
#define GPIO_FUNC67_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4463C))
#define GPIO_FUNC68_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44640))
#define GPIO_FUNC69_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44644))
#define GPIO_FUNC70_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44648))
#define GPIO_FUNC71_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4464C))
#define GPIO_FUNC72_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44650))
#define GPIO_FUNC73_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44654))
#define GPIO_FUNC74_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44658))
#define GPIO_FUNC75_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4465C))
#define GPIO_FUNC76_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44660))
#define GPIO_FUNC77_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44664))
#define GPIO_FUNC78_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44668))
#define GPIO_FUNC79_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4466C))
#define GPIO_FUNC80_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44670))
#define GPIO_FUNC81_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44674))
#define GPIO_FUNC82_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44678))
#define GPIO_FUNC83_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4467C))
#define GPIO_FUNC84_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44680))
#define GPIO_FUNC85_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44684))
#define GPIO_FUNC86_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44688))
#define GPIO_FUNC87_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4468C))
#define GPIO_FUNC88_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44690))
#define GPIO_FUNC89_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44694))
#define GPIO_FUNC90_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44698))
#define GPIO_FUNC91_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4469C))
#define GPIO_FUNC92_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446A0))
#define GPIO_FUNC93_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446A4))
#define GPIO_FUNC94_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446A8))
#define GPIO_FUNC95_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446AC))
#define GPIO_FUNC96_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446B0))
#define GPIO_FUNC97_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446B4))
#define GPIO_FUNC98_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446B8))
#define GPIO_FUNC99_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446BC))
#define GPIO_FUNC100_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446C0))
#define GPIO_FUNC101_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446C4))
#define GPIO_FUNC102_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446C8))
#define GPIO_FUNC103_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446CC))
#define GPIO_FUNC104_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446D0))
#define GPIO_FUNC105_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446D4))
#define GPIO_FUNC106_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446D8))
#define GPIO_FUNC107_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446DC))
#define GPIO_FUNC108_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446E0))
#define GPIO_FUNC109_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446E4))
#define GPIO_FUNC110_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446E8))
#define GPIO_FUNC111_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446EC))
#define GPIO_FUNC112_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446F0))
#define GPIO_FUNC113_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446F4))
#define GPIO_FUNC114_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446F8))
#define GPIO_FUNC115_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF446FC))
#define GPIO_FUNC116_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44700))
#define GPIO_FUNC117_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44704))
#define GPIO_FUNC118_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44708))
#define GPIO_FUNC119_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4470C))
#define GPIO_FUNC120_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44710))
#define GPIO_FUNC121_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44714))
#define GPIO_FUNC122_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44718))
#define GPIO_FUNC123_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4471C))
#define GPIO_FUNC124_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44720))
#define GPIO_FUNC125_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44724))
#define GPIO_FUNC126_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44728))
#define GPIO_FUNC127_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4472C))
#define GPIO_FUNC128_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44730))
#define GPIO_FUNC129_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44734))
#define GPIO_FUNC130_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44738))
#define GPIO_FUNC131_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4473C))
#define GPIO_FUNC132_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44740))
#define GPIO_FUNC133_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44744))
#define GPIO_FUNC134_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44748))
#define GPIO_FUNC135_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4474C))
#define GPIO_FUNC136_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44750))
#define GPIO_FUNC137_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44754))
#define GPIO_FUNC138_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44758))
#define GPIO_FUNC139_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4475C))
#define GPIO_FUNC140_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44760))
#define GPIO_FUNC141_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44764))
#define GPIO_FUNC142_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44768))
#define GPIO_FUNC143_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4476C))
#define GPIO_FUNC144_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44770))
#define GPIO_FUNC145_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44774))
#define GPIO_FUNC146_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44778))
#define GPIO_FUNC147_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4477C))
#define GPIO_FUNC148_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44780))
#define GPIO_FUNC149_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44784))
#define GPIO_FUNC150_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44788))
#define GPIO_FUNC151_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4478C))
#define GPIO_FUNC152_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44790))
#define GPIO_FUNC153_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44794))
#define GPIO_FUNC154_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44798))
#define GPIO_FUNC155_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4479C))
#define GPIO_FUNC156_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447A0))
#define GPIO_FUNC157_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447A4))
#define GPIO_FUNC158_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447A8))
#define GPIO_FUNC159_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447AC))
#define GPIO_FUNC160_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447B0))
#define GPIO_FUNC161_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447B4))
#define GPIO_FUNC162_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447B8))
#define GPIO_FUNC163_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447BC))
#define GPIO_FUNC164_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447C0))
#define GPIO_FUNC165_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447C4))
#define GPIO_FUNC166_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447C8))
#define GPIO_FUNC167_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447CC))
#define GPIO_FUNC168_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447D0))
#define GPIO_FUNC169_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447D4))
#define GPIO_FUNC170_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447D8))
#define GPIO_FUNC171_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447DC))
#define GPIO_FUNC172_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447E0))
#define GPIO_FUNC173_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447E4))
#define GPIO_FUNC174_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447E8))
#define GPIO_FUNC175_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447EC))
#define GPIO_FUNC176_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447F0))
#define GPIO_FUNC177_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447F4))
#define GPIO_FUNC178_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447F8))
#define GPIO_FUNC179_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF447FC))
#define GPIO_FUNC180_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44800))
#define GPIO_FUNC181_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44804))
#define GPIO_FUNC182_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44808))
#define GPIO_FUNC183_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4480C))
#define GPIO_FUNC184_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44810))
#define GPIO_FUNC185_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44814))
#define GPIO_FUNC186_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44818))
#define GPIO_FUNC187_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4481C))
#define GPIO_FUNC188_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44820))
#define GPIO_FUNC189_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44824))
#define GPIO_FUNC190_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44828))
#define GPIO_FUNC191_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4482C))
#define GPIO_FUNC192_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44830))
#define GPIO_FUNC193_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44834))
#define GPIO_FUNC194_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44838))
#define GPIO_FUNC195_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4483C))
#define GPIO_FUNC196_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44840))
#define GPIO_FUNC197_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44844))
#define GPIO_FUNC198_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44848))
#define GPIO_FUNC199_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4484C))
#define GPIO_FUNC200_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44850))
#define GPIO_FUNC201_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44854))
#define GPIO_FUNC202_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44858))
#define GPIO_FUNC203_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4485C))
#define GPIO_FUNC204_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44860))
#define GPIO_FUNC205_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44864))
#define GPIO_FUNC206_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44868))
#define GPIO_FUNC207_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4486C))
#define GPIO_FUNC208_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44870))
#define GPIO_FUNC209_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44874))
#define GPIO_FUNC210_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44878))
#define GPIO_FUNC211_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4487C))
#define GPIO_FUNC212_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44880))
#define GPIO_FUNC213_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44884))
#define GPIO_FUNC214_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44888))
#define GPIO_FUNC215_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4488C))
#define GPIO_FUNC216_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44890))
#define GPIO_FUNC217_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44894))
#define GPIO_FUNC218_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44898))
#define GPIO_FUNC219_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4489C))
#define GPIO_FUNC220_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448A0))
#define GPIO_FUNC221_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448A4))
#define GPIO_FUNC222_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448A8))
#define GPIO_FUNC223_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448AC))
#define GPIO_FUNC224_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448B0))
#define GPIO_FUNC225_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448B4))
#define GPIO_FUNC226_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448B8))
#define GPIO_FUNC227_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448BC))
#define GPIO_FUNC228_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448C0))
#define GPIO_FUNC229_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448C4))
#define GPIO_FUNC230_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448C8))
#define GPIO_FUNC231_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448CC))
#define GPIO_FUNC232_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448D0))
#define GPIO_FUNC233_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448D4))
#define GPIO_FUNC234_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448D8))
#define GPIO_FUNC235_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448DC))
#define GPIO_FUNC236_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448E0))
#define GPIO_FUNC237_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448E4))
#define GPIO_FUNC238_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448E8))
#define GPIO_FUNC239_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448EC))
#define GPIO_FUNC240_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448F0))
#define GPIO_FUNC241_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448F4))
#define GPIO_FUNC242_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448F8))
#define GPIO_FUNC243_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF448FC))
#define GPIO_FUNC244_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44900))
#define GPIO_FUNC245_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44904))
#define GPIO_FUNC246_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44908))
#define GPIO_FUNC247_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4490C))
#define GPIO_FUNC248_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44910))
#define GPIO_FUNC249_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44914))
#define GPIO_FUNC250_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44918))
#define GPIO_FUNC251_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4491C))
#define GPIO_FUNC252_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44920))
#define GPIO_FUNC253_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44924))
#define GPIO_FUNC254_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF44928))
#define GPIO_FUNC255_OUT_SEL_CFG_REG (*((unsigned long *)0x3FF4492C))

#endif